; domain
(define (domain parking)
 (:requirements :strips :typing  )
 (:types car curb)
 (:predicates 
    (at-curb ?car - car) 
    (at-curb-num ?car - car ?curb - curb)
    (behind-car ?car ?front-car - car)
    (car-clear ?car - car) 
    (curb-clear ?curb - curb)
 )

 

	(:action move-curb-to-curb
		:parameters (?car - car ?curbsrc ?curbdest - curb)
		:precondition (and 
			(car-clear ?car)
			(curb-clear ?curbdest)
			(at-curb-num ?car ?curbsrc)
		)
		:effect (and 
			(not (curb-clear ?curbdest))
			(curb-clear ?curbsrc)
			(at-curb-num ?car ?curbdest)
			(not (at-curb-num ?car ?curbsrc))
                         
		)
	)

	(:action move-curb-to-car
		:parameters (?car - car ?curbsrc - curb ?cardest - car)
		:precondition (and 
			(car-clear ?car)
			(car-clear ?cardest)
			(at-curb-num ?car ?curbsrc)
			(at-curb ?cardest) 
		)
		:effect (and 
			(not (car-clear ?cardest))
			(curb-clear ?curbsrc)
			(behind-car ?car ?cardest)
			(not (at-curb-num ?car ?curbsrc))
			(not (at-curb ?car))
                         
		)
	)

	(:action move-car-to-curb
		:parameters (?car - car ?carsrc - car ?curbdest - curb)
		:precondition (and 
			(car-clear ?car)
			(curb-clear ?curbdest)
			(behind-car ?car ?carsrc)
		)
		:effect (and 
			(not (curb-clear ?curbdest))
			(car-clear ?carsrc)
			(at-curb-num ?car ?curbdest)
			(not (behind-car ?car ?carsrc))
			(at-curb ?car)
                         
		)
	)

	(:action move-car-to-car
		:parameters (?car - car ?carsrc - car ?cardest - car)
		:precondition (and 
			(car-clear ?car)
			(car-clear ?cardest)
			(behind-car ?car ?carsrc)
			(at-curb ?cardest) 
		)
		:effect (and 
			(not (car-clear ?cardest))
			(car-clear ?carsrc)
			(behind-car ?car ?cardest)
			(not (behind-car ?car ?carsrc))
                         
		)
	)
)

; problem
(define   (problem parking)
  (:domain parking)
  (:objects
     car_00  car_01  car_02  car_03  car_04  car_05  car_06  car_07  car_08  car_09  car_10  car_11  car_12  car_13  car_14  car_15  car_16  car_17  car_18  car_19  car_20  car_21  car_22  car_23  car_24  car_25  car_26  car_27  car_28  car_29 - car
     curb_00 curb_01 curb_02 curb_03 curb_04 curb_05 curb_06 curb_07 curb_08 curb_09 curb_10 curb_11 curb_12 curb_13 curb_14 curb_15 - curb
  )
  (:init
     
    (at-curb car_22)
    (at-curb-num car_22 curb_00)
    (behind-car car_09 car_22)
    (car-clear car_09)
    (at-curb car_26)
    (at-curb-num car_26 curb_01)
    (behind-car car_16 car_26)
    (car-clear car_16)
    (at-curb car_04)
    (at-curb-num car_04 curb_02)
    (behind-car car_11 car_04)
    (car-clear car_11)
    (at-curb car_23)
    (at-curb-num car_23 curb_03)
    (behind-car car_18 car_23)
    (car-clear car_18)
    (at-curb car_03)
    (at-curb-num car_03 curb_04)
    (behind-car car_12 car_03)
    (car-clear car_12)
    (at-curb car_07)
    (at-curb-num car_07 curb_05)
    (behind-car car_13 car_07)
    (car-clear car_13)
    (at-curb car_20)
    (at-curb-num car_20 curb_06)
    (behind-car car_17 car_20)
    (car-clear car_17)
    (at-curb car_02)
    (at-curb-num car_02 curb_07)
    (behind-car car_05 car_02)
    (car-clear car_05)
    (at-curb car_29)
    (at-curb-num car_29 curb_08)
    (behind-car car_08 car_29)
    (car-clear car_08)
    (at-curb car_15)
    (at-curb-num car_15 curb_09)
    (behind-car car_10 car_15)
    (car-clear car_10)
    (at-curb car_27)
    (at-curb-num car_27 curb_10)
    (behind-car car_06 car_27)
    (car-clear car_06)
    (at-curb car_14)
    (at-curb-num car_14 curb_11)
    (behind-car car_28 car_14)
    (car-clear car_28)
    (at-curb car_19)
    (at-curb-num car_19 curb_12)
    (behind-car car_24 car_19)
    (car-clear car_24)
    (at-curb car_25)
    (at-curb-num car_25 curb_13)
    (behind-car car_21 car_25)
    (car-clear car_21)
    (at-curb car_01)
    (at-curb-num car_01 curb_14)
    (car-clear car_01)
    (at-curb car_00)
    (at-curb-num car_00 curb_15)
    (car-clear car_00)
  )
  (:goal
    (and
      (at-curb-num car_00 curb_00)
      (behind-car car_16 car_00)
      (at-curb-num car_01 curb_01)
      (behind-car car_17 car_01)
      (at-curb-num car_02 curb_02)
      (behind-car car_18 car_02)
      (at-curb-num car_03 curb_03)
      (behind-car car_19 car_03)
      (at-curb-num car_04 curb_04)
      (behind-car car_20 car_04)
      (at-curb-num car_05 curb_05)
      (behind-car car_21 car_05)
      (at-curb-num car_06 curb_06)
      (behind-car car_22 car_06)
      (at-curb-num car_07 curb_07)
      (behind-car car_23 car_07)
      (at-curb-num car_08 curb_08)
      (behind-car car_24 car_08)
      (at-curb-num car_09 curb_09)
      (behind-car car_25 car_09)
      (at-curb-num car_10 curb_10)
      (behind-car car_26 car_10)
      (at-curb-num car_11 curb_11)
      (behind-car car_27 car_11)
      (at-curb-num car_12 curb_12)
      (behind-car car_28 car_12)
      (at-curb-num car_13 curb_13)
      (behind-car car_29 car_13)
      (at-curb-num car_14 curb_14)
      (at-curb-num car_15 curb_15)
    )
  )
 
)
; =========== INIT =========== 
;  curb_00: car_22 car_09 
;  curb_01: car_26 car_16 
;  curb_02: car_04 car_11 
;  curb_03: car_23 car_18 
;  curb_04: car_03 car_12 
;  curb_05: car_07 car_13 
;  curb_06: car_20 car_17 
;  curb_07: car_02 car_05 
;  curb_08: car_29 car_08 
;  curb_09: car_15 car_10 
;  curb_10: car_27 car_06 
;  curb_11: car_14 car_28 
;  curb_12: car_19 car_24 
;  curb_13: car_25 car_21 
;  curb_14: car_01 
;  curb_15: car_00 
; ========== /INIT =========== 

; =========== GOAL =========== 
;  curb_00: car_00 car_16 
;  curb_01: car_01 car_17 
;  curb_02: car_02 car_18 
;  curb_03: car_03 car_19 
;  curb_04: car_04 car_20 
;  curb_05: car_05 car_21 
;  curb_06: car_06 car_22 
;  curb_07: car_07 car_23 
;  curb_08: car_08 car_24 
;  curb_09: car_09 car_25 
;  curb_10: car_10 car_26 
;  curb_11: car_11 car_27 
;  curb_12: car_12 car_28 
;  curb_13: car_13 car_29 
;  curb_14: car_14 
;  curb_15: car_15 
; =========== /GOAL ===========

; plan
1. (move-car-to-car car_28 car_14 car_01)
   deleted: (car-clear car_01) (behind-car car_28 car_14)
   added: (car-clear car_14) (behind-car car_28 car_01)
   goals met: 0 of 30
2. (move-curb-to-car car_00 curb_15 car_14)
   deleted: (car-clear car_14) (at-curb-num car_00 curb_15) (at-curb car_00)
   added: (curb-clear curb_15) (behind-car car_00 car_14)
   goals met: 0 of 30
3. (move-car-to-curb car_09 car_22 curb_15)
   deleted: (curb-clear curb_15) (behind-car car_09 car_22)
   added: (car-clear car_22) (at-curb-num car_09 curb_15) (at-curb car_09)
   goals met: 0 of 30
4. (move-curb-to-car car_22 curb_00 car_09)
   deleted: (car-clear car_09) (at-curb-num car_22 curb_00) (at-curb car_22)
   added: (curb-clear curb_00) (behind-car car_22 car_09)
   goals met: 0 of 30
5. (move-car-to-curb car_00 car_14 curb_00)
   deleted: (curb-clear curb_00) (behind-car car_00 car_14)
   added: (car-clear car_14) (at-curb-num car_00 curb_00) (at-curb car_00)
   goals met: 1 of 30
6. (move-car-to-car car_16 car_26 car_00)
   deleted: (car-clear car_00) (behind-car car_16 car_26)
   added: (car-clear car_26) (behind-car car_16 car_00)
   goals met: 2 of 30
7. (move-car-to-car car_28 car_01 car_26)
   deleted: (car-clear car_26) (behind-car car_28 car_01)
   added: (car-clear car_01) (behind-car car_28 car_26)
   goals met: 2 of 30
8. (move-car-to-car car_24 car_19 car_14)
   deleted: (car-clear car_14) (behind-car car_24 car_19)
   added: (car-clear car_19) (behind-car car_24 car_14)
   goals met: 2 of 30
9. (move-curb-to-car car_01 curb_14 car_19)
   deleted: (car-clear car_19) (at-curb-num car_01 curb_14) (at-curb car_01)
   added: (curb-clear curb_14) (behind-car car_01 car_19)
   goals met: 2 of 30
10. (move-car-to-curb car_28 car_26 curb_14)
   deleted: (curb-clear curb_14) (behind-car car_28 car_26)
   added: (car-clear car_26) (at-curb-num car_28 curb_14) (at-curb car_28)
   goals met: 2 of 30
11. (move-curb-to-car car_26 curb_01 car_28)
   deleted: (car-clear car_28) (at-curb-num car_26 curb_01) (at-curb car_26)
   added: (curb-clear curb_01) (behind-car car_26 car_28)
   goals met: 2 of 30
12. (move-car-to-curb car_01 car_19 curb_01)
   deleted: (curb-clear curb_01) (behind-car car_01 car_19)
   added: (car-clear car_19) (at-curb-num car_01 curb_01) (at-curb car_01)
   goals met: 3 of 30
13. (move-car-to-car car_17 car_20 car_01)
   deleted: (car-clear car_01) (behind-car car_17 car_20)
   added: (car-clear car_20) (behind-car car_17 car_01)
   goals met: 4 of 30
14. (move-car-to-car car_05 car_02 car_20)
   deleted: (car-clear car_20) (behind-car car_05 car_02)
   added: (car-clear car_02) (behind-car car_05 car_20)
   goals met: 4 of 30
15. (move-car-to-car car_26 car_28 car_19)
   deleted: (car-clear car_19) (behind-car car_26 car_28)
   added: (car-clear car_28) (behind-car car_26 car_19)
   goals met: 4 of 30
16. (move-curb-to-car car_02 curb_07 car_28)
   deleted: (car-clear car_28) (at-curb-num car_02 curb_07) (at-curb car_02)
   added: (curb-clear curb_07) (behind-car car_02 car_28)
   goals met: 4 of 30
17. (move-car-to-curb car_11 car_04 curb_07)
   deleted: (curb-clear curb_07) (behind-car car_11 car_04)
   added: (car-clear car_04) (at-curb-num car_11 curb_07) (at-curb car_11)
   goals met: 4 of 30
18. (move-curb-to-car car_04 curb_02 car_11)
   deleted: (car-clear car_11) (at-curb-num car_04 curb_02) (at-curb car_04)
   added: (curb-clear curb_02) (behind-car car_04 car_11)
   goals met: 4 of 30
19. (move-car-to-curb car_02 car_28 curb_02)
   deleted: (curb-clear curb_02) (behind-car car_02 car_28)
   added: (car-clear car_28) (at-curb-num car_02 curb_02) (at-curb car_02)
   goals met: 5 of 30
20. (move-car-to-car car_18 car_23 car_02)
   deleted: (car-clear car_02) (behind-car car_18 car_23)
   added: (car-clear car_23) (behind-car car_18 car_02)
   goals met: 6 of 30
21. (move-car-to-car car_12 car_03 car_28)
   deleted: (car-clear car_28) (behind-car car_12 car_03)
   added: (car-clear car_03) (behind-car car_12 car_28)
   goals met: 6 of 30
22. (move-car-to-car car_26 car_19 car_23)
   deleted: (car-clear car_23) (behind-car car_26 car_19)
   added: (car-clear car_19) (behind-car car_26 car_23)
   goals met: 6 of 30
23. (move-curb-to-car car_03 curb_04 car_19)
   deleted: (car-clear car_19) (at-curb-num car_03 curb_04) (at-curb car_03)
   added: (curb-clear curb_04) (behind-car car_03 car_19)
   goals met: 6 of 30
24. (move-car-to-curb car_26 car_23 curb_04)
   deleted: (curb-clear curb_04) (behind-car car_26 car_23)
   added: (car-clear car_23) (at-curb-num car_26 curb_04) (at-curb car_26)
   goals met: 6 of 30
25. (move-curb-to-car car_23 curb_03 car_26)
   deleted: (car-clear car_26) (at-curb-num car_23 curb_03) (at-curb car_23)
   added: (curb-clear curb_03) (behind-car car_23 car_26)
   goals met: 6 of 30
26. (move-car-to-curb car_03 car_19 curb_03)
   deleted: (curb-clear curb_03) (behind-car car_03 car_19)
   added: (car-clear car_19) (at-curb-num car_03 curb_03) (at-curb car_03)
   goals met: 7 of 30
27. (move-curb-to-car car_19 curb_12 car_03)
   deleted: (car-clear car_03) (at-curb-num car_19 curb_12) (at-curb car_19)
   added: (curb-clear curb_12) (behind-car car_19 car_03)
   goals met: 8 of 30
28. (move-car-to-curb car_23 car_26 curb_12)
   deleted: (curb-clear curb_12) (behind-car car_23 car_26)
   added: (car-clear car_26) (at-curb-num car_23 curb_12) (at-curb car_23)
   goals met: 8 of 30
29. (move-curb-to-car car_26 curb_04 car_23)
   deleted: (car-clear car_23) (at-curb-num car_26 curb_04) (at-curb car_26)
   added: (curb-clear curb_04) (behind-car car_26 car_23)
   goals met: 8 of 30
30. (move-car-to-curb car_04 car_11 curb_04)
   deleted: (curb-clear curb_04) (behind-car car_04 car_11)
   added: (car-clear car_11) (at-curb-num car_04 curb_04) (at-curb car_04)
   goals met: 9 of 30
31. (move-car-to-car car_05 car_20 car_11)
   deleted: (car-clear car_11) (behind-car car_05 car_20)
   added: (car-clear car_20) (behind-car car_05 car_11)
   goals met: 9 of 30
32. (move-curb-to-car car_20 curb_06 car_04)
   deleted: (car-clear car_04) (at-curb-num car_20 curb_06) (at-curb car_20)
   added: (curb-clear curb_06) (behind-car car_20 car_04)
   goals met: 10 of 30
33. (move-car-to-curb car_13 car_07 curb_06)
   deleted: (curb-clear curb_06) (behind-car car_13 car_07)
   added: (car-clear car_07) (at-curb-num car_13 curb_06) (at-curb car_13)
   goals met: 10 of 30
34. (move-curb-to-car car_07 curb_05 car_13)
   deleted: (car-clear car_13) (at-curb-num car_07 curb_05) (at-curb car_07)
   added: (curb-clear curb_05) (behind-car car_07 car_13)
   goals met: 10 of 30
35. (move-car-to-curb car_05 car_11 curb_05)
   deleted: (curb-clear curb_05) (behind-car car_05 car_11)
   added: (car-clear car_11) (at-curb-num car_05 curb_05) (at-curb car_05)
   goals met: 11 of 30
36. (move-car-to-car car_21 car_25 car_05)
   deleted: (car-clear car_05) (behind-car car_21 car_25)
   added: (car-clear car_25) (behind-car car_21 car_05)
   goals met: 12 of 30
37. (move-car-to-car car_07 car_13 car_25)
   deleted: (car-clear car_25) (behind-car car_07 car_13)
   added: (car-clear car_13) (behind-car car_07 car_25)
   goals met: 12 of 30
38. (move-curb-to-car car_13 curb_06 car_11)
   deleted: (car-clear car_11) (at-curb-num car_13 curb_06) (at-curb car_13)
   added: (curb-clear curb_06) (behind-car car_13 car_11)
   goals met: 12 of 30
39. (move-car-to-curb car_06 car_27 curb_06)
   deleted: (curb-clear curb_06) (behind-car car_06 car_27)
   added: (car-clear car_27) (at-curb-num car_06 curb_06) (at-curb car_06)
   goals met: 13 of 30
40. (move-car-to-car car_22 car_09 car_06)
   deleted: (car-clear car_06) (behind-car car_22 car_09)
   added: (car-clear car_09) (behind-car car_22 car_06)
   goals met: 14 of 30
41. (move-car-to-car car_13 car_11 car_27)
   deleted: (car-clear car_27) (behind-car car_13 car_11)
   added: (car-clear car_11) (behind-car car_13 car_27)
   goals met: 14 of 30
42. (move-curb-to-car car_11 curb_07 car_09)
   deleted: (car-clear car_09) (at-curb-num car_11 curb_07) (at-curb car_11)
   added: (curb-clear curb_07) (behind-car car_11 car_09)
   goals met: 14 of 30
43. (move-car-to-curb car_07 car_25 curb_07)
   deleted: (curb-clear curb_07) (behind-car car_07 car_25)
   added: (car-clear car_25) (at-curb-num car_07 curb_07) (at-curb car_07)
   goals met: 15 of 30
44. (move-car-to-car car_26 car_23 car_25)
   deleted: (car-clear car_25) (behind-car car_26 car_23)
   added: (car-clear car_23) (behind-car car_26 car_25)
   goals met: 15 of 30
45. (move-curb-to-car car_23 curb_12 car_07)
   deleted: (car-clear car_07) (at-curb-num car_23 curb_12) (at-curb car_23)
   added: (curb-clear curb_12) (behind-car car_23 car_07)
   goals met: 16 of 30
46. (move-car-to-curb car_08 car_29 curb_12)
   deleted: (curb-clear curb_12) (behind-car car_08 car_29)
   added: (car-clear car_29) (at-curb-num car_08 curb_12) (at-curb car_08)
   goals met: 16 of 30
47. (move-car-to-car car_26 car_25 car_29)
   deleted: (car-clear car_29) (behind-car car_26 car_25)
   added: (car-clear car_25) (behind-car car_26 car_29)
   goals met: 16 of 30
48. (move-car-to-car car_24 car_14 car_25)
   deleted: (car-clear car_25) (behind-car car_24 car_14)
   added: (car-clear car_14) (behind-car car_24 car_25)
   goals met: 16 of 30
49. (move-curb-to-car car_08 curb_12 car_14)
   deleted: (car-clear car_14) (at-curb-num car_08 curb_12) (at-curb car_08)
   added: (curb-clear curb_12) (behind-car car_08 car_14)
   goals met: 16 of 30
50. (move-car-to-curb car_26 car_29 curb_12)
   deleted: (curb-clear curb_12) (behind-car car_26 car_29)
   added: (car-clear car_29) (at-curb-num car_26 curb_12) (at-curb car_26)
   goals met: 16 of 30
51. (move-curb-to-car car_29 curb_08 car_26)
   deleted: (car-clear car_26) (at-curb-num car_29 curb_08) (at-curb car_29)
   added: (curb-clear curb_08) (behind-car car_29 car_26)
   goals met: 16 of 30
52. (move-car-to-curb car_08 car_14 curb_08)
   deleted: (curb-clear curb_08) (behind-car car_08 car_14)
   added: (car-clear car_14) (at-curb-num car_08 curb_08) (at-curb car_08)
   goals met: 17 of 30
53. (move-car-to-car car_24 car_25 car_08)
   deleted: (car-clear car_08) (behind-car car_24 car_25)
   added: (car-clear car_25) (behind-car car_24 car_08)
   goals met: 18 of 30
54. (move-car-to-car car_11 car_09 car_25)
   deleted: (car-clear car_25) (behind-car car_11 car_09)
   added: (car-clear car_09) (behind-car car_11 car_25)
   goals met: 18 of 30
55. (move-car-to-car car_29 car_26 car_14)
   deleted: (car-clear car_14) (behind-car car_29 car_26)
   added: (car-clear car_26) (behind-car car_29 car_14)
   goals met: 18 of 30
56. (move-curb-to-car car_09 curb_15 car_26)
   deleted: (car-clear car_26) (at-curb-num car_09 curb_15) (at-curb car_09)
   added: (curb-clear curb_15) (behind-car car_09 car_26)
   goals met: 18 of 30
57. (move-car-to-curb car_10 car_15 curb_15)
   deleted: (curb-clear curb_15) (behind-car car_10 car_15)
   added: (car-clear car_15) (at-curb-num car_10 curb_15) (at-curb car_10)
   goals met: 18 of 30
58. (move-curb-to-car car_15 curb_09 car_10)
   deleted: (car-clear car_10) (at-curb-num car_15 curb_09) (at-curb car_15)
   added: (curb-clear curb_09) (behind-car car_15 car_10)
   goals met: 18 of 30
59. (move-car-to-curb car_09 car_26 curb_09)
   deleted: (curb-clear curb_09) (behind-car car_09 car_26)
   added: (car-clear car_26) (at-curb-num car_09 curb_09) (at-curb car_09)
   goals met: 19 of 30
60. (move-car-to-car car_11 car_25 car_26)
   deleted: (car-clear car_26) (behind-car car_11 car_25)
   added: (car-clear car_25) (behind-car car_11 car_26)
   goals met: 19 of 30
61. (move-curb-to-car car_25 curb_13 car_09)
   deleted: (car-clear car_09) (at-curb-num car_25 curb_13) (at-curb car_25)
   added: (curb-clear curb_13) (behind-car car_25 car_09)
   goals met: 20 of 30
62. (move-car-to-curb car_15 car_10 curb_13)
   deleted: (curb-clear curb_13) (behind-car car_15 car_10)
   added: (car-clear car_10) (at-curb-num car_15 curb_13) (at-curb car_15)
   goals met: 20 of 30
63. (move-car-to-car car_29 car_14 car_15)
   deleted: (car-clear car_15) (behind-car car_29 car_14)
   added: (car-clear car_14) (behind-car car_29 car_15)
   goals met: 20 of 30
64. (move-curb-to-car car_10 curb_15 car_14)
   deleted: (car-clear car_14) (at-curb-num car_10 curb_15) (at-curb car_10)
   added: (curb-clear curb_15) (behind-car car_10 car_14)
   goals met: 20 of 30
65. (move-car-to-curb car_13 car_27 curb_15)
   deleted: (curb-clear curb_15) (behind-car car_13 car_27)
   added: (car-clear car_27) (at-curb-num car_13 curb_15) (at-curb car_13)
   goals met: 20 of 30
66. (move-curb-to-car car_27 curb_10 car_13)
   deleted: (car-clear car_13) (at-curb-num car_27 curb_10) (at-curb car_27)
   added: (curb-clear curb_10) (behind-car car_27 car_13)
   goals met: 20 of 30
67. (move-car-to-curb car_10 car_14 curb_10)
   deleted: (curb-clear curb_10) (behind-car car_10 car_14)
   added: (car-clear car_14) (at-curb-num car_10 curb_10) (at-curb car_10)
   goals met: 21 of 30
68. (move-car-to-car car_11 car_26 car_14)
   deleted: (car-clear car_14) (behind-car car_11 car_26)
   added: (car-clear car_26) (behind-car car_11 car_14)
   goals met: 21 of 30
69. (move-curb-to-car car_26 curb_12 car_10)
   deleted: (car-clear car_10) (at-curb-num car_26 curb_12) (at-curb car_26)
   added: (curb-clear curb_12) (behind-car car_26 car_10)
   goals met: 22 of 30
70. (move-car-to-curb car_11 car_14 curb_12)
   deleted: (curb-clear curb_12) (behind-car car_11 car_14)
   added: (car-clear car_14) (at-curb-num car_11 curb_12) (at-curb car_11)
   goals met: 22 of 30
71. (move-car-to-car car_29 car_15 car_14)
   deleted: (car-clear car_14) (behind-car car_29 car_15)
   added: (car-clear car_15) (behind-car car_29 car_14)
   goals met: 22 of 30
72. (move-car-to-car car_27 car_13 car_15)
   deleted: (car-clear car_15) (behind-car car_27 car_13)
   added: (car-clear car_13) (behind-car car_27 car_15)
   goals met: 22 of 30
73. (move-curb-to-car car_11 curb_12 car_13)
   deleted: (car-clear car_13) (at-curb-num car_11 curb_12) (at-curb car_11)
   added: (curb-clear curb_12) (behind-car car_11 car_13)
   goals met: 22 of 30
74. (move-car-to-curb car_29 car_14 curb_12)
   deleted: (curb-clear curb_12) (behind-car car_29 car_14)
   added: (car-clear car_14) (at-curb-num car_29 curb_12) (at-curb car_29)
   goals met: 22 of 30
75. (move-curb-to-car car_14 curb_11 car_29)
   deleted: (car-clear car_29) (at-curb-num car_14 curb_11) (at-curb car_14)
   added: (curb-clear curb_11) (behind-car car_14 car_29)
   goals met: 22 of 30
76. (move-car-to-curb car_11 car_13 curb_11)
   deleted: (curb-clear curb_11) (behind-car car_11 car_13)
   added: (car-clear car_13) (at-curb-num car_11 curb_11) (at-curb car_11)
   goals met: 23 of 30
77. (move-car-to-car car_27 car_15 car_11)
   deleted: (car-clear car_11) (behind-car car_27 car_15)
   added: (car-clear car_15) (behind-car car_27 car_11)
   goals met: 24 of 30
78. (move-car-to-car car_14 car_29 car_13)
   deleted: (car-clear car_13) (behind-car car_14 car_29)
   added: (car-clear car_29) (behind-car car_14 car_13)
   goals met: 24 of 30
79. (move-curb-to-car car_29 curb_12 car_15)
   deleted: (car-clear car_15) (at-curb-num car_29 curb_12) (at-curb car_29)
   added: (curb-clear curb_12) (behind-car car_29 car_15)
   goals met: 24 of 30
80. (move-car-to-curb car_12 car_28 curb_12)
   deleted: (curb-clear curb_12) (behind-car car_12 car_28)
   added: (car-clear car_28) (at-curb-num car_12 curb_12) (at-curb car_12)
   goals met: 25 of 30
81. (move-curb-to-car car_28 curb_14 car_12)
   deleted: (car-clear car_12) (at-curb-num car_28 curb_14) (at-curb car_28)
   added: (curb-clear curb_14) (behind-car car_28 car_12)
   goals met: 26 of 30
82. (move-car-to-curb car_14 car_13 curb_14)
   deleted: (curb-clear curb_14) (behind-car car_14 car_13)
   added: (car-clear car_13) (at-curb-num car_14 curb_14) (at-curb car_14)
   goals met: 27 of 30
83. (move-curb-to-car car_13 curb_15 car_14)
   deleted: (car-clear car_14) (at-curb-num car_13 curb_15) (at-curb car_13)
   added: (curb-clear curb_15) (behind-car car_13 car_14)
   goals met: 27 of 30
84. (move-car-to-curb car_29 car_15 curb_15)
   deleted: (curb-clear curb_15) (behind-car car_29 car_15)
   added: (car-clear car_15) (at-curb-num car_29 curb_15) (at-curb car_29)
   goals met: 27 of 30
85. (move-curb-to-car car_15 curb_13 car_29)
   deleted: (car-clear car_29) (at-curb-num car_15 curb_13) (at-curb car_15)
   added: (curb-clear curb_13) (behind-car car_15 car_29)
   goals met: 27 of 30
86. (move-car-to-curb car_13 car_14 curb_13)
   deleted: (curb-clear curb_13) (behind-car car_13 car_14)
   added: (car-clear car_14) (at-curb-num car_13 curb_13) (at-curb car_13)
   goals met: 28 of 30
87. (move-car-to-car car_15 car_29 car_14)
   deleted: (car-clear car_14) (behind-car car_15 car_29)
   added: (car-clear car_29) (behind-car car_15 car_14)
   goals met: 28 of 30
88. (move-curb-to-car car_29 curb_15 car_13)
   deleted: (car-clear car_13) (at-curb-num car_29 curb_15) (at-curb car_29)
   added: (curb-clear curb_15) (behind-car car_29 car_13)
   goals met: 29 of 30
89. (move-car-to-curb car_15 car_14 curb_15)
   deleted: (curb-clear curb_15) (behind-car car_15 car_14)
   added: (car-clear car_14) (at-curb-num car_15 curb_15) (at-curb car_15)
   goals met: 30 of 30
